---
kind: other
id: Methods.T:Autodesk.Revit.UI.IExternalResourceUIServer
source: html/edf2381c-7f68-1268-032e-1bee1f382173.htm
---
# IExternalResourceUIServer Methods

Implement this method to return the id of the server which is associated with this UI server.